package main;

import view.MainWindow;

/**
 * Класс с точкой входа в программy.
 *
 * @author Mikalay
 */
public class Main {
//ТЕСТЫ!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! 
//ВИД - МОДЕЛЬ MVC!!!!!!!!    
//план на сегодня:
//проверка почты через регулярку
//добавление  в мемо - интерфейс
// в XLSXParser добавить ошибку в лог - "не тип строки"
//добавить возможность не только для одного листа    
//проверка - если есть хоть 1 null, то имя неполное, если все null - то игнорим
//при ошибке выводим строку номер и текст тот, что есть
//добавление инструкции в представление  
//более плотное логгирование и проверка возвращаемых значений для всех операций 
//просмотреть каждый catch  
// подправить документацию 
//проверка строк на размер
//проверка наличия и корректности почты   

//////////////////////////////////////////////////////////////    
//<template> <\tempate>
//<link><\link>
//<image><\image>
/////////////////////////////
    public static void main(String[] args) {
        //   MyLog.logMsg("Начало работы программы.");
        //  testFormMessages();
        MainWindow frame = new MainWindow();

    }
}
